src/InformationRegisters/ГруппыАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАналогов</Name>
			<Comment>Группы аналогов номенклатуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент пересчета базовых единиц Заменитель / заменяемое</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>первым аналогом будет с наименьшим знеачением</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаменяемого</Name>
					<Comment>Количество заменяемого в заменителе (масса нетто)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы аналогов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура прайс-листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГруппыАналогов/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "Группы аналогов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// проверим находится ли уже такой аналог в группе
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ГруппыАналогов.Номенклатура
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
	|	И ГруппыАналогов.Номенклатура = &Номенклатура";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номенклатура",        ЭтотОбъект[0].Номенклатура);
	ПараметрыЗапроса.Вставить("ИдентификаторГруппы", ЭтотОбъект[0].ИдентификаторГруппы);
	
	РезультатЗапроса = УправлениеДиалогомВызовСервера.ВыполнитьПроизвольныйЗапрос(ТекстЗапроса,, ПараметрыЗапроса);
	
	// Если нашли аналог выводим сообщение и делаем отказ
	Если НЕ ЭтотОбъект[0].Номенклатура = ЭтотОбъект.Отбор.Номенклатура.Значение ИЛИ НЕ ЭтотОбъект[0].ИдентификаторГруппы = ЭтотОбъект.Отбор.ИдентификаторГруппы.Значение Тогда
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			ВывестиСообщение(НСтр("ru='Номенклатура аналога не уникальна.'"),ЭтотОбъект,,, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	//// проверим находится ли уже такой аналог в группе
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	ГруппыАналогов.Номенклатура
	//|ИЗ
	//|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	//|ГДЕ
	//|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
	//|	И ГруппыАналогов.Приоритет = &Приоритет";
	//
	//ПараметрыЗапроса = Новый Структура;
	//ПараметрыЗапроса.Вставить("Приоритет",           ЭтотОбъект[0].Приоритет);
	//ПараметрыЗапроса.Вставить("ИдентификаторГруппы", ЭтотОбъект[0].ИдентификаторГруппы);
	//
	//РезультатЗапроса = УправлениеДиалогомВызовСервера.ВыполнитьПроизвольныйЗапрос(ТекстЗапроса,, ПараметрыЗапроса);
	//
	//// Если нашли аналог выводим сообщение и делаем отказ
	//Если НЕ ЭтотОбъект[0].Номенклатура = ЭтотОбъект.Отбор.Номенклатура.Значение ИЛИ НЕ ЭтотОбъект[0].ИдентификаторГруппы = ЭтотОбъект.Отбор.ИдентификаторГруппы.Значение Тогда
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		
	//		ВывестиСообщение(НСтр("ru='Номенклатура аналога не уникальна.'"),ЭтотОбъект,,, Отказ);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
